Revit 2027 API
ElectricalDemandFactorValue.Factor Property
 The demand factor for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the demand factor will be 1.0.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Factor { get; set; }
Public Property Factor As Double
	Get
	Set
public:
property double Factor {
	double get ();
	void set (double value);
}
member Factor : float with get, set
Property Value
Double
See Also
Reference
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace